app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("username", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "marychelle"], ["body", "Today is Thursday!"], ["created_at", "2017-07-20 08:06:31.975886"], ["updated_at", "2017-07-20 08:06:31.975886"]]